🚀&nbsp; env0 had composed a PR Plan for environment [Dev - 244172364962 / FrontEnd Servers EC2-32846 ](https://app.env0.com/p/901ee468-466d-4743-9c48-b21c9a3533b7/environments/ae592ec2-564c-4106-b9fe-868d18ae68ee?organizationId=159555bc-0cbd-4a65-9616-466f2f1793cd):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.acme-ec2.aws_instance.this[0] will be created
+   resource "aws_instance" "this" {
+       ami                                  = "ami-0a15226b1f7f23580"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_termination              = false
+       ebs_optimized                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3a.medium"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = false
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = "subnet-0239c0713c64a677f"
+       tags                                 = {
+           "Demo"      = "May 20"
+           "Name"      = "acme-frontend"
+           "Owner"     = "acme demo org"
+           "Terraform" = "true"
+           "Test"      = "new taga"
        }
+       tags_all                             = {
+           "Demo"      = "May 20"
+           "Name"      = "acme-frontend"
+           "Owner"     = "acme demo org"
+           "Terraform" = "true"
+           "Test"      = "new taga"
        }
+       tenancy                              = "default"
+       volume_tags                          = {
+           "Name" = "acme-frontend"
        }
+       vpc_security_group_ids               = (known after apply)

+       credit_specification {
+           cpu_credits = "standard"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   instances  = [
+       (known after apply),
    ]
+   private_ip = [
+       (known after apply),
    ]
+   public_ip  = [
+       (known after apply),
    ]
```
</details>


```
Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$28 ($0.00 → $28)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: env0/acme-demo/.env0workdir/env0_tf_plan.json

+ module.acme-ec2.aws_instance.this[0]
  +$28

+     Instance usage (Linux/UNIX, on-demand, t3a.medium)
      +$27

+     root_block_device
    
+         Storage (general purpose SSD, gp2)
          +$0.80

Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$28 ($0.00 → $28)

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly estimate increased by $28 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ env0/acme-demo/.env0workdir/env0_tf_plan.json      ┃          +$28 ┃           - ┃         +$28 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/901ee468-466d-4743-9c48-b21c9a3533b7/environments/ae592ec2-564c-4106-b9fe-868d18ae68ee/deployments/f829ba21-5d66-4a7e-99f2-1fc87ff69b5f?organizationId=159555bc-0cbd-4a65-9616-466f2f1793cd)

[![env0-ai-summary-banner](https://app.env0.com/images/vcs-comment-ai-summary-banner.png)](https://app.env0.com/p/901ee468-466d-4743-9c48-b21c9a3533b7/environments/ae592ec2-564c-4106-b9fe-868d18ae68ee/deployments/f829ba21-5d66-4a7e-99f2-1fc87ff69b5f?organizationId=159555bc-0cbd-4a65-9616-466f2f1793cd&ai-analyzer=plan-summary)